{"title": "State Legislators, Gun Victims and Gun Shop Owners.", "keywords": ["Washington Post Writers Group Cartoonist Group Philadelphia Daily News hand gun control handgun control gun control hand gun rights handgun rights  of gun owners been shot teen hand gun death teen hand gun deaths handgun death handgun deaths teen firearm death teen firearm deaths teen handgun homicide teen handgun homicides teen  hand gun homicides teen hand gun homicide teen gun homicide teen gun homicides teen gun death teen gun deaths handgun deaths of children hand gun deaths of children firearm deaths of children hand gun murder hand gun murders handgun murder handgun murders firearm murder firearm murders crime crimes state gun law state gun laws state gun legislation 2nd amendment second amendment amendments bill of rights constitution child kid kids teenager teenagers youth youths hand gun trafficking handgun trafficking firearm trafficking straw buying of handgun straw buying of handguns straw buying of gun straw buying of guns straw buying of firearm straw buying of firearms state legislature state legislatures firearm shop firearm shops handgun shop handgun shops hand gun shop hand gun shops gun shoppe gun straw buyer bun straw buyers gun straw-buyer gun straw-buyers handgun straw buyer handgun straw buyers handgun straw-buyer handgun straw-buyers firearm straw buyer firearm straw buyers vulnerable constituents vulnerable constituent state politician state politicians handgun owner hand gun owner handgun owners hand gun owners firearm owner firearm owners gun retailer gun retailers  hand gun retailer hand gun retailers handgun retailer handgun retailers firearm retailer firearm retailers handgun violence hand gun violence"], "caption": "State Legislature.  Another child's been shot!  We must protect our most vulnerable constituents!  Gun Shoppe.  Strawbuyers Welcome!  No Questions!  Ask About Our Frequent Buyer Club.", "image_url": "http://editorialcartoonists.org/cartoons/WilkiS/2005/WilkiS20050625_low.jpg"}